source/gpas-project/deploy/test/multithreading.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.1" jmeter="3.1 r1770033">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Testplan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Benutzer definierte Variablen" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="BeanShell Pre-Prozessor" enabled="true">
        <boolProp name="resetInterpreter">false</boolProp>
        <stringProp name="script">vars.put(&quot;origValue&quot;, UUID.randomUUID().toString().substring(0,5));
</stringProp>
      </BeanShellPreProcessor>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread-Gruppe" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Schleifen-Controller (Loop Controller)" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">5</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1522162343000</longProp>
        <longProp name="ThreadGroup.end_time">1522162343000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="Import-Data UUIDs" enabled="true"/>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="getOrCreateForList" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:psn=&quot;http://psn.ttp.ganimed.icmvc.emau.org/&quot;&gt;&#xd;
   &lt;soapenv:Header/&gt;&#xd;
   &lt;soapenv:Body&gt;&#xd;
      &lt;psn:getOrCreatePseudonymForList&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_001&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_002&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_003&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_004&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_005&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_006&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_007&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_008&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_009&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_100&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_101&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_102&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_103&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_104&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_105&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_106&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_107&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_108&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_109&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_110&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_201&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_202&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_203&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_204&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_205&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_206&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_207&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_208&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_209&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_210&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_301&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_302&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_303&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_304&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_305&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_306&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_307&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_308&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_309&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_310&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_401&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_402&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_403&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_404&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_405&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_406&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_407&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_408&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_409&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_410&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_501&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_502&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_503&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_504&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_505&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_506&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_507&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_508&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_509&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_510&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_601&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_602&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_603&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_604&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_605&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_606&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_607&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_608&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_609&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_610&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_701&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_702&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_703&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_704&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_705&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_706&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_707&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_708&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_709&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_710&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_801&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_802&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_803&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_804&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_805&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_806&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_807&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_808&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_809&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_810&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_901&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_902&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_903&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_904&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_905&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_906&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_907&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_908&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_909&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_910&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_001&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_002&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_003&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_004&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_005&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_006&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_007&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_008&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_009&lt;/values&gt;&#xd;
         &lt;values&gt;${__time(HMS)}_010&lt;/values&gt;&#xd;
         &lt;domainName&gt;TestDomain&lt;/domainName&gt;&#xd;
      &lt;/psn:getOrCreatePseudonymForList&gt;&#xd;
   &lt;/soapenv:Body&gt;&#xd;
&lt;/soapenv:Envelope&gt;&#xd;
</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">8080</stringProp>
            <stringProp name="HTTPSampler.path">gpas/gpasService</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="test StatusCode200" enabled="false">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">true</boolProp>
              <intProp name="Assertion.test_type">16</intProp>
            </ResponseAssertion>
            <hashTree/>
            <XMLAssertion guiclass="XMLAssertionGui" testclass="XMLAssertion" testname="test isXML" enabled="false"/>
            <hashTree/>
            <XPathAssertion guiclass="XPathAssertionGui" testclass="XPathAssertion" testname="test xPath no Exception" enabled="false">
              <boolProp name="XPath.negate">true</boolProp>
              <stringProp name="XPath.xpath">/Envelope/Body/Fault/faultstring</stringProp>
              <boolProp name="XPath.validate">false</boolProp>
              <boolProp name="XPath.whitespace">false</boolProp>
              <boolProp name="XPath.tolerant">false</boolProp>
              <boolProp name="XPath.namespace">false</boolProp>
            </XPathAssertion>
            <hashTree/>
            <XPathAssertion guiclass="XPathAssertionGui" testclass="XPathAssertion" testname="test xPath MATCHSTATUS" enabled="false">
              <boolProp name="XPath.negate">false</boolProp>
              <stringProp name="XPath.xpath">/Envelope/Body/requestMPIResponse/return/matchStatus/text()=&apos;NO_MATCH&apos;</stringProp>
              <boolProp name="XPath.validate">false</boolProp>
              <boolProp name="XPath.whitespace">false</boolProp>
              <boolProp name="XPath.tolerant">false</boolProp>
              <boolProp name="XPath.namespace">false</boolProp>
            </XPathAssertion>
            <hashTree/>
          </hashTree>
          <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Graph" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>